# NElementsWrongPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..NElementsWrongPosition Property
BuiltInFailures..::..EditingFailures Class See Also
---
Review [Number] elements for correct position and shape
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NElementsWrongPosition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NElementsWrongPosition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NElementsWrongPosition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace